# Задача №2938. Дележ яблок - 1
# N школьников делят K яблок поровну, неделящийся остаток остается в корзинке.
# Сколько яблок достанется каждому школьнику?

# входные данные
# 3
# 14
# выходные данные
# 4

n = int(input())
k = int(input())

print(k//n)