# Задача №2941. Последняя цифра
# Дано натуральное число. Выведите его последнюю цифру.
#
# Примеры
# входные данные
# 179
# выходные данные
# 9
n = int(input())
print(n % 10)
