# Задача №2942. Число десятков двузначного числа
# Дано двузначное число. Найдите число десятков в нем.

# входные данные
# 42
# выходные данные
# 4

n = int(input())
print(n // 10)
